Repository: Optimusu/Trial
Catalog: Trial.Domain/Resources/Resource.*.resx
Languages: es

source: Active
es: Activo

source: Address
es: Direccion

source: Cities
es: Ciudades

source: City
es: Ciudad

# CodPhone
source: Code
es: Codigo

source: Company/Person
es: Empresa/Persona

source: Corporation
es: Corporacion

source: Country
es: Pais

source: Date End
es: Fecha Fin

source: Date Start
es: Fecha Inicio

source: Description
es: Descripcion

source: Document
es: Documento

source: Email
es: Correo

source: First Name
es: Nombre

# FullName
source: Name
es: Nombre

source: Image
es: Imagen

source: Job Position
es: Puesto Trabajo

source: Last Name
es: Apellido

source: Months
es: Meses

source: Origin
es: Origen

source: Phone
es: Telefono

source: Photo
es: Foto

source: Price
es: Precio

source: Trials Count
es: Cantidad Estudios

source: Role User
es: Rol Usuario

source: Soft Plan
es: Plan Software

source: State
es: Estado/Departamento

source: States
es: Estado/Departamento (s)

source: Type Document
es: Tipo Documento

source: User
es: Usuario

source: User Type
es: Tipo Usuario

# Validation_MaxLength
source: The Field {0} cannot be longer than {1} characteres
es: El Campo {0} no puede tener mas de {1} largo

# Validation_Required
source: The Field {0} is required
es: El Campo {0} es requerido

# Validation_MinLength
source: The Field {0} must be at least {1} characters long
es: El Campo {0} debe tener al menos {1} caracteres

# Generic_AuthEmailFail
source: Failed to retrieve authenticated user's email
es: No se pudo obtener el correo del usuario autenticado

# Generic_AuthIdFail
source: Failed to retrieve user identifier
es: No se pudo obtener el identificador del usuario

# Generic_AuthRequired
source: You must be logged in to access this resource
es: Debe iniciar sesión para acceder a este recurso

# Generic_AuthRoleFail
source: Failed to retrieve user role
es: No se pudo obtener el rol del usuario

# Generic_UnexpectedError
source: An unexpected error occurred. Please try again later
es: Ocurrio un error inesperado. Por favor, intentelo nuevamente más tarde

# Generic_InvalidId
source: There seems to be an issue with the information provided
es: Parece que hubo un problema con la información ingresada

# Generic_IdNotFound
source: We couldn't find what you were looking for
es: No pudimos encontrar el registro

# Generic_Success
source: Everything was completed successfully
es: Todo se realizo correctamente

# Generic_InvalidModel
source: There was a problem with the data submitted
es: Parece que hubo un error con los datos enviados

# Generic_NullException
source: Tried to access a null value
es: Se intento acceder a un valor nulo

# Generic_Exception
source: General exception with no specific cause
es: Excepcion sin causa especifica

# Generic_Http_BadRequest
source: Malformed or invalid request
es: Solicitud malformada o invalida

# Db_Duplicate
source: Duplicate value in the database
es: Valor duplicado en la base de datos

# Db_Reference
source: Reference error, invalid foreign key
es: Error de referencia, clave foranea invalida

# Db_Error
source: General database error
es: Error general de base de datos

# Db_Concurrency
source: Data concurrency conflict
es: Conflicto por concurrencia de datos

# Key_NewPassword
source: New Password
es: Nueva Clave

# Key_ConfirmPassword
source: Confirm Password
es: Confirmar Clave

# Validation_BetweenLength
source: The field must be between {0} and {1} characters long
es: El campo debe tener entre {0} y {1} caracteres

# Validation_PasswordMismatch
source: Passwords do not match, please check
es: No coinciden las claves, verifique

# Validation_InvalidEmail
source: {0} is not a valid email address
es: El {0} no es un correo válido

# Key_CurrentPassword
source: Current Password
es: Clave Actual

# Generic_UserFail
source: Failed to retrieve user data
es: Problemas para conseguir el usuario

# Generic_InvalidCredentials
source: Invalid username or password
es: Usuario o clave erróneos

# Generic_AccessDenied
source: Sorry, you do not have access to the system
es: Lo siento, no tiene acceso al sistema

# Generic_UserBlocked
source: The account is temporarily blocked
es: Se encuentra temporalmente bloqueado

# Generic_PlanExpired
source: Your plan has expired, please renew your account
es: El tiempo del plan se ha cumplido, debe renovar su cuenta

# Generic_CorporationInactive
source: The corporation you are trying to access is inactive, Please contact the system administrator
es: La corporacion que trata de acceder se encuentra inactiva. Contacte al administrador del sistema

# Generic_UserNoRoleAssigned
source: This user is active but has no role assigned
es: Este usuario esta activo pero no tiene ningun role asignado

# Generic_UserInactive
source: The user is inactive. Please contact the system administrator
es: El usuario se encuentra inactivo. Contacte al administrador del sistema

# Generic_UserCreationFail
source: Could not create the user. Please try again
es: No se ha podido crear el usuario. Inténtelo de nuevo

# Generic_EmailAlreadyUsed
source: This email is already associated with another account
es: Este correo ya se encuentra asignado a otra cuenta

# Generic_RecordDeletedNoImage
source: The record was deleted, but the image was not removed
es: Se eliminó el registro pero sin la imagen

# Key_SelectUserRole
source: Select User Type
es: Seleccione Tipo Usuario
